[
  {
    "Name": "Basque Burnt Cheesecake",
    "Picture": "Basque Burnt Cheesecake.jpg",
    "Genre": "Dessert",
    "Ingredients": "· 2 lb. cream cheese, room temperature\n· 1½ cups sugar\n· 6 eggs\n· 2 cups heavy cream\n· 1 tsp. kosher salt\n· 1 tsp. vanilla extract\n· ½ cup all-purpose flour",
    "Step": "·Step 1\nPreheat the oven to 400°F. Put a sheet of parchment in the cake pan. \n\n·Step 2\nBeat cream cheese and sugar in the bowl of a stand mixer fitted with the paddle attachment on medium-low speed until very smooth, and sugar has dissolved.\n\n· Step 3\nIncrease speed to medium and add eggs at a time. Reduce mixer speed to medium-low. Add cream, salt, and vanilla extract and beat until combined, about 30 seconds.\n\n· Step 4\nTurn off mixer and sift flour evenly over cream cheese mixture using a fine-mesh sieve. Beat on low speed until incorporated, about 15 seconds. \n\n·Step 5\nPour batter into prepared cake pan. Bake cheesecake for 40mins until deeply golden brown on top.\n\n· Step 6\nLet cool slightly, then unmold. Let cool completely. Carefully peel away parchment from sides of cheesecake. Slice into wedges and serve at room temperature.",
    "TimeSpent": "1-2 h",
    "Servings": "4-6",
    "Applicableoccasions": "Party\nMovie Night"
  },
  {
    "Name": "Tuscan Salmon",
    "Picture": "Tuscan Salmon.jpg",
    "Genre": "Potluck\nLunch/Dinner",
    "Ingredients": "· 2 tbsp. olive oil\n· 4 (6-oz) salmon fillets\n· Kosher salt\n· Ground black pepper\n· 3 tbsp. butter\n· 3 cloves garlic, minced\n· 1 1/2 c. halved cherry tomatoes\n· 2 c. baby spinach\n· 1/2 c. heavy cream",
    "Step": "· Step 1\nIn a large skillet over medium-high heat, heat oil. Season salmon all over with salt and pepper. When oil is shimmering but not smoking, add salmon skin side up and cook until deeply golden, about 6 minutes. Flip over and cook 2 minutes more. Transfer to a plate.\n\n· Step 2\nReduce heat to medium and add butter. When butter has melted, stir in garlic and cook until fragrant, about 1 minute. Add cherry tomatoes and season with salt and pepper. Cook until tomatoes are beginning to burst, then add spinach. Cook until spinach is beginning to wilt.\n\n· Step 3\nStir in heavy cream, Parmesan, and herbs and bring mixture to a simmer. Reduce heat to low and simmer until sauce is slightly reduced, about 3 minutes.\n\n· Step 4\nReturn salmon back to skillet and spoon over sauce. Simmer until salmon is cooked through, about 3 minutes more.\n\n· Step 5\nGarnish with more herbs and squeeze lemon on top before serving.",
    "TimeSpent": "30min",
    "Servings": "1-2",
    "Applicableoccasions": "Dating"
  },
  {
    "Name": "Strawberry Cake Roll",
    "Picture": "Strawberry Cake Roll.jpg",
    "Genre": "Dessert",
    "Ingredients": "· 6 eggs\n· 1 ½ cups sugar\n· 2 tablespoons oil\n· 2 teaspoons baking powder\n· ½ teaspoon salt\n· 2 teaspoons vanilla\n· 1 ½ cups flour\n· ¼ cup powdered sugar\n· 8 oz cream cheese, softened\n· 1 tablespoon vanilla extract",
    "Step": "· Step 1\nPreheat the oven to 350°F.\n\n· Step 2\nIn a bowl, whisk the eggs until pale yellow, about 2 minutes. Add in the ¹¹⁄₄ cups sugar and whisk again until combined.\n\n· Step 3\nMix in oil, baking powder, salt, and vanilla extract. Add in flour, and fold until smooth and combined.\nPour the batter on a parchment paper-lined baking sheet and spread evenly. Gently tap the baking sheet on the counter to release any air bubbles.\n\n· Step 4\nBake for 20 minutes, or until cooked through. Invert it onto a plate till room temperature.\n\n· Step 5\nMix the cream cheese, remaining sugar, and vanilla in a bowl. Set aside. Place the cake on the counter and unroll. Spread the cream cheese mixture in an even layer over the cake and top with strawberries.\n\n· Step 6\nLift and roll the cake into a roll, then chill in the refrigerator for 30 minutes.\n\n· Step 7\nTightly roll the cake bake up. Top with powdered sugar and decorate the cake with strawberries. Slice and serve.",
    "TimeSpent": "1-2 h",
    "Servings": "2-4",
    "Applicableoccasions": "Party\nMovie Night\nDating"
  },
  {
    "Name": "Mulled Red Wine",
    "Picture": "Mulled Red Wine.jpg",
    "Genre": "Beverage",
    "Ingredients": "· 1 (750-ml.) bottle red wine\n· 1 orange, sliced into rounds\n· 5 whole cloves\n· 3 cinnamon sticks, plus more for garnish\n· 3 star anise\n· 1/4 c. honey\n· 1/2 c. brandy",
    "Step": "· Step 1\nIn a medium saucepan over medium heat, combine all ingredients. Bring to a simmer not a boil, then reduce heat to medium-low. \n\n· Step 2\nSimmer gently over low heat for 10 minutes.\n\n· Step 3\nServe warm and garnish with more citrus slices and cinnamon sticks.",
    "TimeSpent": "30min",
    "Servings": "2-4",
    "Applicableoccasions": "Party\nMovie Night\nDating"
  },
  {
    "Name": "Special for Movie Night",
    "Picture": "Special for Movie Night.jpg",
    "Genre": "Dessert",
    "Ingredients": "· Cherries\n· Different types of grapes\n· Blackberries\n· Raspberries\n· Most important: a glass of champagne or wine!",
    "Step": "Step 1\n· Just wash all the fruits and stack them nicely\n\nStep 2\n· Pick yourself a nice glass and pour a glass of your favorite wine!\n\nDo Ahead: Pick a favorite movie and adjust your seat",
    "TimeSpent": "30min",
    "Servings": "1-2",
    "Applicableoccasions": "Movie Night"
  },
  {
    "Name": "Crab cake",
    "Picture": "Crab cake.jpg",
    "Genre": "Potluck\nLunch/Dinner",
    "Ingredients": "· 1/3 c. mayonnaise\n· 1 beaten egg\n· 2 tbsp. Dijon mustard\n· 2 tsp. Worcestershire sauce\n· 1/2 tsp. hot sauce\n· 1/2 tsp. Kosher Salt\n· 1/2 tsp. Black pepper\n· 1 lb. jumbo lump crabmeat\n· 3/4 c. bread crumbs\n· 2 tbsp. chopped Parsley\n· Canola oil, for frying\n· Lemon wedges, for serving\n· Tartar sauce, for serving",
    "Step": "Step 1\n· In a small bowl, whisk together mayo, egg, Dijon mustard, Worcestershire, and hot sauce, and season with salt and pepper.\n\nStep 2\n· In a medium bowl, stir together crabmeat, bread crumbs, and parsley. Fold in mayo mixture, then form into 6 patties.\n\nStep 3\n· In a large skillet over medium-high heat, coat pan with oil and heat until shimmering. Add crab cakes and cook, in batches, until golden and crispy, 3 to 5 minutes per side.\n\nStep 4\n· Serve with lemon and tartar sauce.",
    "TimeSpent": "30-1h",
    "Servings": "1-2",
    "Applicableoccasions": "Dating"
  },
  {
    "Name": "Eggs Benedict",
    "Picture": "Eggs Benedict.jpg",
    "Genre": "Potluck",
    "Ingredients": "· 3 whole English muffins\n· 6 slices Canadian bacon\n· 2 sticks butter, plus more for the muffins\n· 6 whole eggs (plus 3 egg yolks)\n· 1 whole lemon, juiced\n· Cayenne pepper\n· Paprika",
    "Step": "· Step 1\nMake the hollandaise: Melt butter in a small pot over medium heat until it's foamy but not yet beginning to brown, 3 to 4 minutes.\n\n· Step 2\nPlace egg yolks and 2 teaspoons water in a blender. Start blending, and, working very slowly, add the hot, melted butter until it's all incorporated. Add lemon juice and cayenne, and season with salt and pepper. Transfer the hollandaise to a small bowl, and place plastic wrap directly on the surface so it doesn't form a skin. Set aside.\n\n· Step 3\nPoach the eggs: Fill a medium pot with 3 inches of water. Add vinegar, season with salt and bring to a simmer. Using the handle of a spoon or spatula, stir the water with a clockwise motion. Gently crack an egg into the center of the pot, letting the water swirl around it and allowing the white to envelop the yolk. Once eggs are perfectly poached, remove from the water, and let drain on a plate lined with paper towels or a clean kitchen towel. Set eggs aside.\n\n· Step 4\nUsing a toaster, toaster oven or regular oven, toast the English muffins until crisp and golden brown. \n\n· Step 5\nCook Canadian bacon or ham (or bacon) in a medium skillet over medium-high heat until golden brown and just crisp at the edges, about 6 minutes.\n\n· Step 6\nAssemble the Benedict: Place English muffin on a plate and butter them generously. Top each with a slice of Canadian bacon, ham or bacon, then a poached egg. Spoon hollandaise sauce over.",
    "TimeSpent": "30-1h",
    "Servings": "1-2",
    "Applicableoccasions": "Brunch\nDating"
  },
  {
    "Name": "Little Cupcakes",
    "Picture": "Little Cupcakes.jpg",
    "Genre": "Dessert",
    "Ingredients": "· 2 ½ cups flour\n· ½ cup unsweetened cocoa powder\n· 1 teaspoon baking soda\n· ½ teaspoon salt\n· 2 cups sugar\n· 1 cup softened butter\n· 4 eggs\n· 1 cup sour cream\n· ½ cup milk\n· 0.2oz bottle red food color\n· 2 teaspoons vanilla extract",
    "Step": "· Step 1\nPreheat the oven to 380°F and place cupcake papers in a cupcake pan. In a large bowl, sift the dry ingredients (including the sugar) and mix them.\n\n· Step 2\nIn a separate bowl, whisk together the wet ingredients until they are well combined, then add some red food coloring. Cut the butter into tablespoon sized dollops and add it to the dry ingredients and beat together.\n\n· Step 3\nAdd the wet ingredients to the dry mixture and mix until everything is incorporated. You may want to add a dash or two more of red food coloring until you reach the desired color.\n\n· Step 4\nDistribute the batter evenly into the cupcake papers and bake for 15 to 20 minutes or until the cupcakes are golden and springy to the touch. Let them cool till room temperature.\n\n· Step 5\nFor the cream cheese frosting; start off by sifting the sugar into a large bowl so there are not any lumps. Cream the room temperature butter on medium speed until it is nice and smooth.\n\n· Step 6\nAdd the cream cheese and beat together until they're combined then add the vanilla and salt. Slowly add the sifted sugar and mix until combined.\n\n· Step 7\nPlace the prepared cream cheese frosting in a pastray bag and squeeze it onto the cupcakes",
    "TimeSpent": "2h",
    "Servings": ">6",
    "Applicableoccasions": "Party\nDating"
  },
  {
    "Name": "Portuguese Egg Tart",
    "Picture": "Portuguese Egg Tart.jpg",
    "Genre": "Dessert",
    "Ingredients": "· 8 egg tart crust\n· ¾ cup granulated sugar\n· 1 cup heavy cream\n· ½ cup milk\n· 1 teaspoon condensed milk\n· 2 eggs\n· 1 egg yolk",
    "Step": "· Step 1\nPreheat the oven to 380°F\n\n· Step 2\nAdd eggs and egg yolks with granulated sugar and mix well, add milk, light cream, condensed milk and mix together. Sift the tart mixture at least twice to make it more delicate\n\n\n· Step 3\nSift the tart mixture at least twice to make it more delicate\n\n· Step 4\nPour the tart mixture into the tart crust and bake in the oven for about 25 minutes until golden brown on top.",
    "TimeSpent": "30-1h",
    "Servings": "4-6",
    "Applicableoccasions": "Party\nDating\nMovie Night"
  },
  {
    "Name": "Lobster Bisque",
    "Picture": "Lobster Bisque.jpg",
    "Genre": "Potluck\nLunch/Dinner",
    "Ingredients": "· 4 (1 1/4–pound; 560g) live lobsters\n· 1 (4-ounce; 115g) stick unsalted butter, plus more for garnish\n· 1/3 cup olive oil\n· 2 medium diced carrots diced\n· 2 medium diced yellow onions (about 1 pound; 450g)\n· 4 medium cloves garlic, crushed\n· 2 tablespoons (25g) tomato paste\n· 1/4 cup (60ml) brandy\n· 1 cup (240ml) dry white wine\n· 5 cups low-sodium chicken broth\n· 3 sprigs tarragon, plus minced leaves for garnish\n· 1/2 cup (120ml) heavy cream\n· Kosher salt and freshly ground white or black pepper\n· Cayenne pepper, to taste",
    "Step": "· Step 1\nUsing a hefty chef's knife, kill each lobster by pressing the tip of the knife in the indentation just behind and between the eyes. Press down firmly, then split head in half. Using kitchen towels, twist off tail and claws (including knuckles) from each lobster carapace.\n\n· Step 2\nSet a cutting board in a rimmed baking sheet on a work surface. Place a steamer insert in the bottom of a large lidded stockpot and add water. Bring to a boil over high heat. Add lobster tails, cover, and cook for 2 minutes. Remove tails and transfer to cutting board. Make sure water is still at a full boil, then add claws, cover pot, and cook for 3 minutes. Remove claws and transfer to cutting board. Reserve water in bottom of steamer; it will now be infused with lobster juices.\n\n· Step 3\nAs soon as lobster is cool enough to handle, remove tail, claw, and knuckle meat from shells using kitchen shears, lobster crackers, and/or the back of a heavy cleaver to help crack shells. Reserve shells; separately reserve any accumulated liquids in the rimmed baking sheet. Cut lobster meat into 1-inch pieces and transfer to the refrigerator.\n· Step 4\nUsing a heavy chef's knife, cut lobster bodies into large pieces (do not discard any parts).\n\n· Step 5\nIn a large Dutch oven or stockpot, combine butter with olive oil and heat over medium-high heat until butter is fully melted and foaming. Add just enough lobster bodies and shells to cover bottom of pot in a single layer and cook, stirring and scraping, until browned, about 5 minutes. Add remaining lobster bodies and shells and cook, stirring and scraping frequently, until all lobster pieces are bright red, fully cooked, and browning on bottom of pot, about 8 minutes longer.\n\n· Step 6\nAdd carrot, onion, celery, and garlic and cook, stirring and scraping bottom of pot, until vegetables are beginning to soften and a new layer of browning has formed on bottom of pot, about 5 minutes. Stir in tomato paste and cook for 1 minute.\n· Step 7\nAdd brandy (be careful if working over a gas flame not to accidentally ignite it) and cook, stirring and scraping bottom of pot, until brandy has mostly evaporated and raw alcohol smell has cooked off. Add white wine, bring to a simmer, and cook, stirring and scraping up any browned bits, until alcohol smell has cooked off.\n\n· Step 8\nAdd reserved lobster-steaming water and collected lobster juices along with chicken stock. There should be just enough liquid to barely cover shells; if not, add enough water to barely cover. Add parsley sprigs, tarragon sprigs, and bay leaf.\n· Step 9\nBring to a boil, then reduce heat and gently simmer, uncovered, for 1 hour.\n\n· Step 10\nStrain lobster stock, pressing well on shells to extract as much liquid as possible; reserve solids. Add lobster stock to a blender. Pick out about 2 cups cooked aromatic vegetables from reserved stock solids and add to blender. Add cream and blend, starting at low speed and gradually increasing to high speed, until soup is completely smooth. Repeat with any remaining lobster stock.\n\n· Step 11\nPass blended soup through a fine-mesh strainer into a clean pot, using a wooden spoon or ladle to work everything through; you should be left with only some tiny bits of lobster shell caught in the strainer when you're done.\n\n· Step 12\nReheat soup, being careful not to let it boil to avoid curdling the cream. Season with salt and pepper, plus just enough cayenne pepper to give the soup a subtle warmth.\n\n· Step 13\nWhen ready to serve, melt about 2 tablespoons (30g) unsalted butter per serving in a skillet over medium-high heat until foaming. Add lobster meat (about 1/4 cup per serving) and cook, stirring and tossing, until just cooked through, 1 to 2 minutes. Add a mixture of minced parsley, tarragon, and chives, tossing to coat. Season with salt and pepper, along with a pinch or two of ground coriander to taste.\n\n· Step 14\nLadle broth into warmed bowls and spoon lobster meat garnish and herb butter into each bowl. If you don't serve it all right away, the soup base and reserved par-cooked lobster meat can be refrigerated, separately, up to 2 days. Reheat soup (without boiling) and finish remaining lobster meat as directed to serve.",
    "TimeSpent": ">2h",
    "Servings": "1-2",
    "Applicableoccasions": "Dating"
  },
  {
    "Name": "Strawberry Cheesecake",
    "Picture": "Strawberry Cheesecake.jpg",
    "Genre": "Dessert",
    "Ingredients": "For the Graham Cracker Crust:\n· 1 3/4 cups cracker crumbs, store-bought\n· 2 tablespoons unsalted butter\n· Pinch of salt\nFor the Cheesecake:\n· 4 cups cream cheese, such as Philadelphia\n· 1 tablespoon lemon juice\n· 1 tablespoon vanilla extract\n· 1/4 teaspoon Diamond Crystal kosher salt\n· 1/4 teaspoon orange flower water\n· 2 cups plain or toasted sugar \n· 6 large eggs\n· 3/4 cup heavy cream",
    "Step": "· Step 1\nFor the Cracker Crust: Add the graham cracker crumbs, melted butter, and salt to the pan, and stir with a fork until well combined. \n\n· Step 2\nFor the Cheesecake: Adjust the oven rack to the middle position and preheat to 450°F. Combine cream cheese, goat cheese, lemon juice, vanilla extract, salt, and orange flower water in the bowl of a stand mixer fitted with a attachment. Do not add the sugar at this time. Mix on low until roughly combined, then increase to medium and cream until no lumps of cheese remain.\n\n· Step 3\nReduce speed to medium-low, add the sugar all at once, and mix only until well combined. Remove the bowl from the stand mixer and place a single-mesh sieve over the bowl, then crack in the eggs, and whisk until they pass through. Discard any clots of chalazae that remain trapped in the strainer. Resume mixing on low until well combined, then scrape the bowl and beater once more.\n\n· Step 4\nIn a 1-quart stainless steel pot, bring the cream to a full boil. While mixing on low, add the hot cream all at once in a steady stream, and mix a few seconds more. This warms the batter, which helps release any air pockets introduced in mixing while reducing the overall bake time. Bring cold batter to room temperature before baking.\n\n· Step 5\nPour batter into the prepared pan and place on a baking sheet. Bounce a spoon across the surface to dislodge any air bubbles that may have slipped through. If you don't see any, no need to continue. If you do notice a few rising up, keep bouncing the spoon until they're gone. Bake until the cheesecake is puffed and dry to the touch around the edges, about 20 minutes. In most ovens, the cheesecake will also begin to brown, forming golden patches along the surface, deepening its flavor. Alternatively, for a denser, paler cheesecake, skip to the next step and bake only at 250°F until done; this may take an hour or more.\n\n· Step 6\nTurn off the oven, open the door, and let it stand ajar 10 minutes.\n\n· Step 7\nLet the cheesecake cool for 15 minutes, then run a thin knife or offset spatula around the sides to loosen. Continue letting it cool at room temperature for at least 1 hour (or up to 4) before covering it to refrigerate until cold to the core, at least 12 hours.\n\nTo Serve: Combine the fresh fruit and warmed fruit syrup or jam in a large bowl, and gently fold with a flexible spatula until the fruit is well coated and glistening (optional). Cut the cheesecake with a large chef's knife dipped in hot water; for clean and tidy portions of cheesecake, pause to clean the blade under hot running water between each slice. Top with spoonfuls of the sauced fruit, if using, or other toppings and sauces as desired.",
    "TimeSpent": ">2h",
    "Servings": "4-6",
    "Applicableoccasions": "Party\nDating"
  },
  {
    "Name": "Christmas Cookies",
    "Picture": "Christmas Cookies.JPG",
    "Genre": "Dessert",
    "Ingredients": "· 150g butter\n· 65g powdered sugar\n· 300g low flour\n· 1 egg",
    "Step": "· Step 1\nButter cut into small pieces, softened in advance and added to the powdered sugar mix smoothly\n\n· Step 2\nAdd the whole egg mixture in three parts until absorbed\n\n· Step 3\nSift in the low gluten flour and mix into a dough\n\n· Step 4\nRoll it out with a rolling pin until it is 3mm thick and chill it in the fridge for 20 minutes.\n\n· Step 5\nPreheat the oven, press out the shapes with cookie molds, transfer to a baking sheet and bake at 200 degrees for 15 minutes.",
    "TimeSpent": "1-2h",
    "Servings": "4-6",
    "Applicableoccasions": "Party\nDating"
  },
  {
    "Name": "Chicken Vegetable Stew",
    "Picture": "Chicken Vegetable Stew.jpg",
    "Genre": "Potluck\nLunch/Dinner",
    "Ingredients": "· 2 chicken thighs\n· 1/4 broccoli\n· 1 tomato\n· 1 corn\n· 1 carrot\n· 150g mushrooms\n· 2tsp olive oil\n· 2tsp soy sauce\n· Black pepper\n· Salt",
    "Step": "· Step 1\nAdd olive oil to the pan and sauté the chicken thighs until brown on both sides.\n\n· Step 2\nAdd the mushrooms and sauté until soft, add the corn, carrots and tomatoes, cover and simmer for 5 minutes\n\n· Step 3\nUncover and add the broccoli, season with salt, black pepper and soy sauce, toss and simmer for another 5 minutes.",
    "TimeSpent": "30-1h",
    "Servings": "2-4",
    "Applicableoccasions": "Party\nDating\nFitness"
  },
  {
    "Name": "Shanghai Vegetable Rice",
    "Picture": "Shanghai Vegetable Rice.jpg",
    "Genre": "Potluck\nLunch/Dinner",
    "Ingredients": "· 1 1/2 cups  rice\n· 2 1/4 cups water\n· 3-4 heads baby bok choy\n· 1 to 2 tablespoons pork oil\n· 1/2 teaspoon sugar\n· 1/4 teaspoon salt\n· 2 tablespoons water\n· 2 tablespoons sesame oil",
    "Step": "· Step 1\nRinse the rice 2 or 3 times and drain. Bring the rice to a boil at medium heat. \n\n· Step 2\nSeparate the stalks and leaves from the baby bok choy. Cut the stalks diagonally and the leaves across.\n\n· Step 3\nHeat the pan and add 1-2 teaspoons pork oil. When the oil is ready, add the bok choy, adding the stalks first, and then the leaves.\n\n· Step 4\nStir in the, sugar, and salt, and stir-fry on high heat for 1 minute. Add the sesame oil. Stir the vegetables into the rice and fluff it up.",
    "TimeSpent": "30-1h",
    "Servings": "2-4",
    "Applicableoccasions": "Party\nDating"
  },
  {
    "Name": "Cinnamon Rolls",
    "Picture": "Cinnamon Rolls.jpg",
    "Genre": "Dessert",
    "Ingredients": "· 2 and 3/4 cups (344g) all-purpose flour\n· 1/4 cup (50g) granulated sugar\n· 1/2 tsp salt\n· 3/4 cup (180ml) whole milk\n· 3 tsp (45g) unsalted butter\n· 2 and 1/4 teaspoons Platinum Yeast\n· 1 large egg, at room temperature",
    "Step": "· Step 1\nMake the dough: Whisk the flour, sugar, and salt together in a large bowl. Set aside.\n\n· Step 2\nCombine the milk and butter together in a heatproof bowl. Microwave or use the stove and heat until the butter has melted and the mixture is warm to the touch (about 110°F/43°C, no higher). Whisk in the yeast until it has dissolved. Pour mixture into the dry ingredients, add the egg, and stir with a sturdy rubber spatula or wooden spoon OR use a stand mixer with a paddle attachment on medium speed. Mix until a soft dough forms.\n\n· Step 3\nTransfer dough to a lightly floured surface. Using floured hands, knead the dough for 3 minutes. You should have a smooth ball of dough. If the dough is super soft or sticky, you can add a little more flour. Place in a lightly greased bowl (I use non-stick spray), cover loosely, and let the dough rest for about 10 minutes as you get the filling ingredients ready.\n\n· Step 4\nFill the rolls: After 10 minutes, roll the dough out in a 14×8-inch (36×20-cm) rectangle. Spread the softened butter on top. Mix together the cinnamon and brown sugar. Sprinkle it all over the dough. Roll up the dough to make a 14-inch log. Cut into 10–12 even rolls and arrange in a lightly greased 9- or 10-inch round cake pan, pie dish, or square baking pan.\n\n· Step 5\nRise: Cover the pan with aluminum foil, plastic wrap, or a clean kitchen towel. Allow the rolls to rise in a relatively warm environment for 60–90 minutes or until double in size.\n\n· Step 6\nBake the rolls: After the rolls have doubled in size, preheat the oven to 375°F (190°C). Bake for 24–27 minutes, or until lightly browned. If you notice the tops are getting too brown too quickly, loosely tent the pan with aluminum foil and continue baking. Remove pan from the oven and place pan on a wire rack as you make the icing.",
    "TimeSpent": ">2h",
    "Servings": "4-6",
    "Applicableoccasions": "Party"
  },
  {
    "Name": "Shanghai Wonton",
    "Picture": "Shanghai Wonton.PNG",
    "Genre": "Potluck\nLunch/Dinner",
    "Ingredients": "· 2 cupsground pork\n· 1 teaspoon Shaoxing wine\n· 1 teaspoon Soy sauce\n· 1 teaspoon sugar\n· 1 teaspoon sesame oil\n· 1 teaspoon salt\n· 1/2 a pack of thin wonton wrappers",
    "Step": "· Step 1\nIn a large bowl, combine the ground pork, salt, Shaoxing wine, soy sauce, white pepper, water, sugar and sesame oil. Mix everything together, stirring in one direction for about 5-8 minutes until the mixture takes on a paste-like texture.\n\n· Step 2\nTo wrap the wontons, place a 1/2 teaspoon of filling on the wrapper. Fold in half, and gently squeeze around the top of the filling.\n\n· Step 3\nIn a separate pot, boil the water for cooking the wontons. While you’re waiting, add the sesame oil and ground white pepper to each of your serving bowls.\n\n· Step 4\nOnce the water boils, add the wontons, and stir lightly. The wontons are done once they float to the top.",
    "TimeSpent": "1-2h",
    "Servings": "1-2",
    "Applicableoccasions": "Brunch"
  },
  {
    "Name": "Shakshuka",
    "Picture": "Shakshuka.jpg",
    "Genre": "Potluck\nLunch/Dinner",
    "Ingredients": "· 2 tablespoons olive oil\n· 1 diced onion\n· 1  seeded and diced red bell pepper\n· 4 chopped garlic cloves\n· 2 teaspoon paprika\n· 1 teaspoon cumin\n· ¼ teaspoon chili powder\n· 1 28-ounce can whole peeled tomatoes\n· 6 eggs\n· salt and pepper,\n· 1 small bunch chopped fresh cilantro and parsley",
    "Step": "· Step 1Heat olive oil in a large sauté pan on medium heat. Add the chopped bell pepper and onion  until the onion becomes translucent.\n\n· Step 2\nAdd garlic and spices and cook an additional minute. Pour the can of tomatoes and juice into the pan and break down the tomatoes using a large spoon. Season with salt and pepper and bring the sauce to a simmer.\n\n· Step 3\nUse your large spoon to make small wells in the sauce and crack the eggs into each well. Cover the pan and cook for 5-8 minutes, or until the eggs are done to your liking.\n\n· Step 4\nGarnish with chopped cilantro and parsley.",
    "TimeSpent": "30min",
    "Servings": "1-2",
    "Applicableoccasions": "Brunch\nDating"
  },
  {
    "Name": "Itlian Vegetable Soup",
    "Picture": "Itlian Vegetable Soup.jpg",
    "Genre": "Potluck\nLunch/Dinner",
    "Ingredients": "· 1 lb. lean ground beef\n· 1/2 yellow onion, diced\n· 4 medium size carrots, thinly sliced \n· 3 stalks celery, thinly sliced\n· 5 cups water\n· 2 cups low sodium beef broth\n· 1 can tomatoes with juices\n· 3 tsp tomato sauce\n· 2 cups green cabbage, roughly chopped\n· 1 1/2 tsp beef base or beef bouillon\n· 1 tsp dried basil\n· 1 tsp dried parsley\n· 1/2 tsp dried oregano\n· 1/2 tsp garlic powder\n· salt and pepper",
    "Step": "· Step 1\nBrown beef and onions then stir in the carrots, celery, tomatoes, tomato sauce, kidney beans, water and beef broth and all of your Italian spices.  The seasonings are what really set this vegetable soup apart.\n\n· Step 2\nBring the soup to a boil, then reduce to a simmer for 15-20 minutes or if you have time the longer the better.\n\n· Step 3\nStir in the corn and optional cabbage.",
    "TimeSpent": "30min",
    "Servings": "1-2",
    "Applicableoccasions": "Brunch\nDating"
  },
  {
    "Name": "Mini Tacos",
    "Picture": "Mini Tacos.jpg",
    "Genre": "Potluck\nLunch/Dinner",
    "Ingredients": "· 1 pound Mushrooms\n· 1 teaspoon olive oil\n· 4 Mexican toco tortillas sheets\n· 1 cup chunk Pineapple\n· 1 cup diced onion\n· Finely chopped cilantro\n· Vegan yogurt\n· Lime\n· 2 teaspoons garlic powder\n· 1 tsp smoked paprika\n· 1/3 tsp black pepper\n· 4 tsp Sugar\n· 4 tsp soy sauce\n· 2 tsp olive oil\n· 1 tsp BBQ sauce\n· 2 tsp water",
    "Step": "· Step 1\nWash the mushrooms, squeeze them dry with your hands, and then tear them into strips. Drizzle with olive oil and scrunch well. Spread on a baking sheet. Bake in oven at 400 degrees F for 15-20 minutes, until mushrooms are slightly golden.\n\n· Step 2\nCombine the ingredients for the sauce and pour over the roasted mushrooms, add the diced pineapple and onion and mix well. Set aside.\n\n· Step 3\nPress the tortillas into mini tortillas in a round mold and heat them in a pan. Add the tortillas to the pan.\n\n· Step 4\nAdd the mushrooms to the tortillas, sprinkle with cilantro and drizzle with a little vegan yogurt and a little lime juice.",
    "TimeSpent": "30-1h",
    "Servings": "2-4",
    "Applicableoccasions": "Party\nMovie Night"
  },
  {
    "Name": "Ratatouille",
    "Picture": "Ratatouille.JPG",
    "Genre": "Potluck\nLunch/Dinner\nVegetarian",
    "Ingredients": "· 2 eggplants\n· 6 roma tomatoes\n· 2 yellow squashes\n· 2 zucchinis\n· 2 tablespoons olive oil\n· 1 medium white onion, diced\n· 4 cloves garlic, minced\n· 1 red bell pepper, seeded and diced\n· 1 yellow bell pepper, seeded and diced\n· Kosher salt\n· Freshly ground black pepper\n· 28 oz crushed tomatoes\n· 3 tablespoons thinly sliced fresh basil\n· 2 tablespoons finely chopped fresh parsley\n· 2 teaspoons fresh thyme leaves",
    "Step": "· Step 1\nPreheat the oven for 375˚F (190˚C).\n\n· Step 2\nUsing a sharp knife, slice the eggplant, tomatoes, squash, and zucchini into approximately ¹⁄₁₆-inch (1-mm)-thick rounds, then set aside.\n\n· Step 3\nMake the sauce: Heat the olive oil in a 12-inch (30-cm) oven-safe pan over medium-high heat. Sauté the onion, garlic, and bell peppers until soft, about 10 minutes. Season with salt and pepper, then add the crushed tomatoes. Stir until the ingredients are fully incorporated. Remove from heat, then add the basil. Stir once more, then smooth the surface of the sauce with a spatula.\n\n· Step 4\nArrange the veggies in alternating slices, (for example, eggplant, tomato, squash, zucchini) on top of the sauce, working from the outer edge to the center of the pan. Season with salt and pepper.\n        \n· Step 5\nMake the herb seasoning: In a small bowl, mix together the basil, garlic, parsley, thyme, salt, pepper, and olive oil. Spoon the herb seasoning over the vegetables.\n\n· Step 6\nCover the pan with foil and bake for 40 minutes. Uncover, then bake for another 20 minutes, until the vegetables are softened.\n\n· Step 7\nServe hot as a main dish or side. The ratatouille is also excellent the next day–cover with foil and reheat in a 350˚F (180˚C) oven for 15 minutes, or simply microwave to desired temperature.",
    "TimeSpent": "1-2h",
    "Servings": "2-4",
    "Applicableoccasions": "Brunch\nDating\nFitness"
  },
  {
    "Name": "Beef Bourguignon",
    "Picture": "Beef Bourguignon.jpg",
    "Genre": "Potluck\nLunch/Dinner",
    "Ingredients": "· 1 bottle of red wine\n·1 teaspoon olive oil\n·1 teaspoon butter\n·1kg beef ribs\n·2 carrots\n·2 onions\n·2 teaspoon flour\n·2 cup water\n·1 celery\n·3 rosemary\n·2 garlic\n·1 teaspoon black pepper\n·1 teaspoon salt\n·1 teaspoon sugar",
    "Step": "· Step 1\nPreheat oven to 350°F (175°C). Heat the oil in a large dutch oven or heavy based pot. Sauté the bacon over medium heat for about 3 minutes, until crisp and browned. Set aside.\n\n· Step 2\nPat dry beef with paper towel; sear in batches in the hot oil/bacon fat until browned on all sides. Remove to the dish with the bacon.\n\n· Step 3\nIn the remaining oil/bacon fat, sauté the carrots and diced onions until softened, then add 4 cloves minced garlic and cook for 1 minute. Drain excess fat and return the bacon and beef back into the pot; season with salt and  pepper. Sprinkle with flour, toss well and cook for 4-5 minutes to brown.\n\n· Step 4\nAdd wine and enough stock so that the meat is barely covered. Then add the tomato paste, bullion and herbs. Bring to a simmer on the stove.\n\n· Step 5\nHeat the butter in a medium-sized skillet/pan over heat. When the foam subsides, add the remaining 2 cloves garlic and cook until fragrant, then add in the mushrooms. Cook for about 5 minutes, while shaking the pan occasionally to coat with the butter. Season with salt and pepper, if desired. Add the mushrooms over the meat.\n\n· Step 6\nGarnish with parsley and serve with mashed potatoes, rice or noodles.",
    "TimeSpent": "1-2h",
    "Servings": "4-6",
    "Applicableoccasions": "Party"
  },
  {
    "Name": "Thai Beef Salad",
    "Picture": "Thai Beef Salad.jpg",
    "Genre": "Potluck\nLunch/Dinner\nVegetarian",
    "Ingredients": "· Sliced beef 200g\n· 1 handful of mint\n· 50g shredded onion\n· 2 cloves of garlic\n· 2 tablespoons of lime juice\n· 2 tablespoons of chili sauce\n· 1 tbsp fish sauce\n· 2 tbsp soy sauce\n· 1 tbsp sugar\n· diced onion\n· Cilantro\n· Black pepper\n· Salt\n· Olive oil",
    "Step": "· Step 1\nBeef slices marinated in advance, a slice into the pan, one side 30 seconds, the surface looks broken raw can be, do not over-fried\n\n· Step 2\nShred onion, add a little salt marinade 5 minutes, squeeze out the water and set aside\n\n· Step 3\nLemon juice, sugar, fish sauce, soy sauce and black pepper mix well\n\n· Step 4\nAdd shredded onion, garlic, chili paste, chopped mint leaves, chopped cilantro and chopped green onion.",
    "TimeSpent": "30min",
    "Servings": "4-6",
    "Applicableoccasions": "Brunch\nDating\nParty\nFitness"
  },
  {
    "Name": "Vegan Tapas",
    "Picture": "Vegan Tapas.jpg",
    "Genre": "Potluck\nLunch/Dinner",
    "Ingredients": "· 8 mushrooms \n· 2 cloves of garlic\n· 2 tsp olive oil\n· vegan grated cheese\n· 1 sprig of rosemary\n· 8 slices of bread\n· 8 slices of vegan cheese\n· 2 tsp minced parsley and garlic\n· 1 teaspoon salt\n· Black pepper\n· 1/4 lemon\n· 8 marinated olives",
    "Step": "· Step 1\nWash and de-stem the mushrooms and place them in the air fryer. To each portobello mushroom, add minced garlic, oil, and grated cheese. Add a sprig of rosemary. 385 degrees, bake for 8 minutes.\n\n· Step 2\nMeanwhile, slice the bread. Slice the garlic and rub the bread with the cross section of garlic to give it a garlic flavor. Top with the cheese slices.\n\n· Step 3\nMix the olive oil, minced parsley garlic, salt, ground black pepper and lemon juice.\n\n· Step 4\nPlace the grilled portobello mushrooms on the bread slices, drizzle with the parsley sauce and insert a pickled olive with a toothpick and stick it into the bread.",
    "TimeSpent": "1-2h",
    "Servings": ">6",
    "Applicableoccasions": "Party\nMovie Night"
  },
  {
    "Name": "Risotto",
    "Picture": "Risotto.jpg",
    "Genre": "Potluck\nLunch/Dinner",
    "Ingredients": "· 6 cups chicken broth\n· 3 tablespoons olive oil, divided\n· 1 pound portobello mushrooms, thinly sliced\n· 1 pound white mushrooms, thinly sliced\n· 2 medium diced shallots\n· 1 ½ cups rice\n· ½ cup dry white wine\n· 4 tablespoons butter\n· 3 tablespoons chopped chives\n· ⅓ cup freshly grated Parmesan cheese\n· sea salt and black pepper",
    "Step": "· Step 1\nWarm broth in a saucepan over low heat.\n\n· Step 2\nMeanwhile, warm 2 tablespoons olive oil in a large saucepan over medium-high heat. Add portobello and white mushrooms; cook and stir until soft, about 3 minutes. Remove mushrooms and their liquid to a bowl; set aside.\n\n· Step 3\nAdd remaining 1 tablespoon olive oil to the saucepan. Stir in shallots and cook for 1 minute. Add rice; cook and stir until rice is coated with oil and pale, golden in color, about 2 minutes.\n\n· Step 4\nPour in wine, stirring constantly until wine is fully absorbed. Add 1/2 cup warm broth to the rice, and stir until the broth is absorbed.\n\n· Step 5\nContinue adding broth, 1/2 cup at a time, stirring constantly, until the liquid is absorbed and the rice is tender, yet firm to the bite, about 15 to 20 minutes.\n\n· Step 6\nRemove from heat. Stir in reserved mushrooms and their liquid, butter, chives, and Parmesan cheese.\n\n· Step 7\nSeason with salt and pepper and serve immediately.",
    "TimeSpent": "30-1h",
    "Servings": "1-2",
    "Applicableoccasions": "Brunch\nDating"
  },
  {
    "Name": "Pretzel",
    "Picture": "Pretzel.jpg",
    "Genre": "Dessert",
    "Ingredients": "· 1 tablespoon dark brown sugar\n· 2 tablespoons softened unsalted butter\n· 2 tablespoons instant yeast\n· 6 cups (about 30 ounces) bread flour\n· 1 tablespoon plus ½ teaspoon kosher salt\n· Food-grade lye, for dipping (see note)\n· Coarse sea salt or pretzel salt, for sprinkling (do not substitute kosher salt)",
    "Step": "· Step 1\nIn a mixing bowl (or bowl of a mixer), stir together syrup, lard or butter, yeast, 2 cups warm water and half the flour. Add kosher salt and remaining flour and stir just until mixture comes together in a shaggy mass.\n\n· Step 2\nTurn out onto counter (or attach dough hook to mixer) and knead for 8 to 10 minutes, until smooth and supple. Cut into 12 pieces and let rest 5 minutes.\n\n· Step 3\nRoll out each piece into a rope about 22 inches long. (For traditional shape, the ends should be thin and the center fat.) Lift both ends, twist them around each other once, then bring ends back and press them on either side of fat “belly,” at about 4 o’clock and 8 o’clock. Then gently spread out “shoulders” of pretzel. Transfer shaped pretzels to an baking sheet.\n\n· Step 4\nLet rest at room temperature for 30 minutes, then refrigerate at least one hour or overnight.\n\n· Step 5\nHeat oven to 425 degrees. In a deep bowl, wearing rubber or latex gloves, make a solution of ½ cup lye and 10 cups water (or 1 part lye to 20 parts water); pour lye carefully into water to avoid splashing. Dip each pretzel in solution, turning it over for 10 to 15 seconds, and place back on baking sheet. \n\n· Step 6\nSprinkle pretzels with salt. Bake about 15 minutes or until deep brown. Remove to a rack and serve warm.",
    "TimeSpent": ">2h",
    "Servings": ">6",
    "Applicableoccasions": "Party"
  },
  {
    "Name": "Vegan Banana Chocolate Pound Cake",
    "Picture": "Vegan Banana Pound Cake.jpg",
    "Genre": "Vegetarian\nDessert",
    "Ingredients": "· 160g of low gluten flour\n· 50g raw cocoa powder\n· 1 teaspoon baking powder\n· 1 teaspoon baking soda\n· 1/2 teaspoon salt\n· 2 bananas\n· 100 ml soy milk\n· 60 ml coconut oil\n· 80 grams of sugar\n· 1 tablespoon vanilla extract\n· Jicama/walnuts",
    "Step": "· Step 1\nCombine the dry ingredients in a large bowl and mix well with a handheld whisk.\n\n· Step 2\nPeel and break two bananas into small pieces, add to another large bowl and puree with a handheld mixer.\n\n· Step 3\nCombine all remaining wet ingredients with the mashed bananas and mix well. Melt the coconut oil in advance until it becomes liquid.\n\n· Step 4\nPour the wet ingredient mixture into the dry ingredients and, using a stirring stick, mix well.\n\n· Step 5\nPlace the dough in a greased or oven paper lined mold and sprinkle the chopped pecans over the top. Bake in a preheated 425 degree oven for about 40 minutes.",
    "TimeSpent": ">2h",
    "Servings": "4-6",
    "Applicableoccasions": "Brunch"
  },
  {
    "Name": "Sparkling Fig Drink",
    "Picture": "Sparkling Fig Drink.jpg",
    "Genre": "Beverage",
    "Ingredients": "- 1 Figs\n- 5-10 Blueberries\n- Sugar-free sparkling water\n- Rose syrup\n- Ice",
    "Step": "· Step 1\nWash the figs and blueberries, cut the figs into thin slices\n· Step 2\nAdd ice cubes and fruit to the glass, then add syrup according to your preference\n· Step 3\nPour in sparkling water",
    "TimeSpent": "30min",
    "Servings": "1-2",
    "Applicableoccasions": "Brunch\nDating\nParty\nMovie Night"
  },
  {
    "Name": "Beef Tartare",
    "Picture": "Beef Tartare.jpg",
    "Genre": "Vegetarian\nDairy-free",
    "Ingredients": "· 220g vegetable beef hamburger steak\n· 1/4 green pepper\n· 1/4 red pepper\n· 1 tomato\n· 1/3 mango\n· 1/2 avocado\n· 1/4 onion\n· cilantro\n· 1/2 lemon\n· 2tsp olive oil\n· salt\n· black pepper\n· Shallots for garnish",
    "Step": "· Step 1\nChop the plant beef hamburger steak, sauté in olive oil for a few moments until cooked through, cool naturally.\n\n· Step 2\nFinely dice green pepper, red pepper, mango, tomato, avocado, onion and cilantro.\n\n· Step 3\nMix all the above ingredients in a large bowl, drizzle with lemon juice, add olive oil, salt and freshly ground black pepper to taste. Toss to combine.\n\n· Step 4\nShape into a round mold. Garnish with finely chopped shallots.",
    "TimeSpent": "30-1h",
    "Servings": "1-2",
    "Applicableoccasions": "Brunch\nDating"
  },
  {
    "Name": "Green Oragne Plum Iced Green Tea",
    "Picture": "Green Oragne Plum Iced Green Tea.jpg",
    "Genre": "Beverage",
    "Ingredients": "· 4 green oranges\n· 15g plum\n· 25g simple syrup\n· 200ml green tea\n· ice\n· mint leaves",
    "Step": "· Step 1\nCut the green oranges in half and remove the seeds.\n\n· Step 2\nPut them into a shaker glass to press out the juice and the aroma of the peel\n\n· Step 3\nAdd ice cubes, tea broth, syrup and plum and shake well to mix.",
    "TimeSpent": "30min",
    "Servings": "1",
    "Applicableoccasions": "Brunch\nDating"
  },
  {
    "Name": "Sabayon",
    "Picture": "Sabayon.jpg",
    "Genre": "Dessert\nDairy-free",
    "Ingredients": "· 4 egg yolks\n· 75 grams of granulated sugar\n· 4 tsp brandy (any sweetened wine)\n· Fruit of your choice",
    "Step": "· Step 1\nPut the egg yolks and sugar in a bowl and mix well\n\n· Step 2\nOnce bubbly, slowly add the wine while stirring constantly\n\n· Step 3\nAdd water to the pot and cook until it starts to bubble. Turn down the heat and add the bowl with the egg paste and heat over water until the sauce thickens\n\n· Step 4\nDrizzle the mixture evenly over the fruit.",
    "TimeSpent": "30min",
    "Servings": "1",
    "Applicableoccasions": "Brunch\nDating"
  }
]